
{
    "catalogue": [
        { "id": 39, "title": "L'Archiviste IA : Étiquetage Automatique de Votre Médiathèque", "industry": "Médias et divertissement", "technology": "Power Automate", "miniDescription": "Utilisez l'IA pour étiqueter et cataloguer automatiquement votre vaste bibliothèque d'actifs numériques, les rendant instantanément consultables en langage naturel.", "technicalLevel": 8, "problem": "Une équipe marketing doit trouver un clip vidéo d'un acteur spécifique prononçant une phrase précise pour une nouvelle bande-annonce. Ils passent des heures à parcourir manuellement des téraoctets de séquences brutes. Le processus est lent, inefficace et repose entièrement sur la mémoire humaine.", "value": "Les entreprises de médias possèdent une mine d'or de contenu. Le problème est de trouver quoi que ce soit. Cette solution utilise l'IA pour 'regarder' et 'écouter' votre contenu, créant automatiquement des métadonnées riches et consultables (tags, transcriptions, reconnaissance d'objets).", "roi": "Le retour sur investissement se mesure en un gain de temps massif pour vos équipes créatives.\n\n<code>Formule :\nÉconomies annuelles = (Heures économisées par recherche * Recherches par an * Coût horaire du personnel créatif)</code>\n\nExemple : Récupérez des milliers d'heures de productivité perdue. Libérez la valeur cachée de vos archives en les rendant facilement accessibles. Accélérez la création de nouveaux contenus.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Moteur d'Indexation IA</h5><p class=\"mb-4 text-gray-600\">Il s'agit d'un flux de travail backend qui enrichit vos actifs multimédias.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Utilisez Azure AI Video Indexer :</strong> C'est la technologie de base. Elle peut transcrire l'audio, identifier les locuteurs, détecter des objets, etc.</li><li><strong>Construisez le Flux :</strong> Déclenchez à partir d'un nouveau fichier ajouté à Azure Blob Storage. Utilisez le connecteur Video Indexer pour démarrer l'indexation. Utilisez une boucle 'Do until' pour attendre la fin. Utilisez 'Parse JSON' pour traiter la sortie. Utilisez une boucle 'Apply to each' pour écrire les mots-clés et les transcriptions dans une base de données consultable.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Créez une interface de recherche personnalisée avec Power Apps. Créez une application qui permet à un utilisateur de taper une requête en langage naturel et qui affiche les résultats sous forme de galerie de clips vidéo jouables.</p>" },
        { "id": 40, "title": "Prédiction et Intervention sur le Désabonnement des Abonnés", "industry": "Médias et divertissement", "technology": "Power Automate", "miniDescription": "Utilisez l'IA pour prédire quels abonnés risquent de résilier et déclenchez automatiquement des offres de rétention ciblées pour les conserver.", "technicalLevel": 7, "problem": "Un service de streaming a des milliers d'abonnés. L'équipe marketing sait que certains clients annuleront leurs abonnements chaque mois, mais ils n'ont aucun moyen de savoir qui est à risque jusqu'à ce qu'il soit trop tard.", "value": "Pour toute entreprise par abonnement, le désabonnement des clients est le tueur silencieux de la croissance. Cette solution utilise l'IA pour analyser le comportement des clients afin de prédire qui est susceptible de se désabonner, vous permettant d'intervenir avec une offre de rétention ciblée avant leur départ.", "roi": "Le retour sur investissement se mesure en revenus conservés.\n\n<code>Formule :\nRevenu annuel conservé = (Nombre d'abonnés sauvés par mois * Prix de l'abonnement mensuel * 12)</code>\n\nExemple : Conserver même un petit pourcentage d'abonnés à risque peut avoir un impact massif sur les résultats. Il est beaucoup moins cher de conserver un client existant que d'en acquérir un nouveau.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Flux de Travail Proactif Basé sur l'IA</h5><p class=\"mb-4 text-gray-600\">Il s'agit d'un flux de travail proactif basé sur les données qui s'exécute selon un calendrier.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Entraînez le Modèle IA :</strong> Utilisez le modèle de prédiction d'AI Builder. Vous aurez besoin de données historiques sur vos abonnés, y compris des caractéristiques telles que leur ancienneté et leur historique de visionnage.</li><li><strong>Construisez le Flux :</strong> Créez un flux cloud planifié pour s'exécuter chaque semaine. Utilisez une action pour obtenir la liste de tous les abonnés actuels. Utilisez une boucle 'Apply to each' pour exécuter l'action 'Prédire' d'AI Builder pour chaque abonné. Utilisez une condition pour vérifier si la probabilité de désabonnement est élevée. Si c'est le cas, déclenchez une campagne marketing ciblée.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Créez un 'code de motif' pour la prédiction de désabonnement. Améliorez le modèle IA pour non seulement prédire le désabonnement, mais aussi pour identifier les principaux facteurs de cette prédiction (par exemple, 'faible engagement'). Le flux peut alors utiliser ce code de motif pour sélectionner l'offre de rétention la plus appropriée.</p>", "interactiveComponent": "ChurnPredictionDemo" },
        { "id": 41, "title": "Traitement des Commandes de Vente Publicitaire", "industry": "Médias et divertissement", "technology": "Power Automate", "miniDescription": "Automatisez l'ensemble du processus de la commande à l'encaissement pour les ventes publicitaires, des vérifications d'inventaire et des approbations à la réservation et à la facturation.", "technicalLevel": 7, "problem": "Un vendeur de publicité conclut une affaire. Il envoie le contrat signé à l'équipe des opérations publicitaires, qui doit ensuite vérifier manuellement la disponibilité de l'inventaire publicitaire, obtenir l'approbation de la finance, puis réserver manuellement la campagne. Le processus est lent.", "value": "Le processus de réservation d'une campagne publicitaire implique plusieurs équipes et systèmes. Cette solution automatise l'ensemble du processus de la commande à l'encaissement.", "roi": "Le ROI se mesure en vitesse, précision et reconnaissance des revenus.\n\n<code>Formule :\nValeur = (Heures administratives économisées * Coût horaire) + (Valeur d'une reconnaissance plus rapide des revenus)</code>\n\nExemple : Accélère le processus de réservation publicitaire, vous permettant de reconnaître les revenus plus rapidement. Réduit le risque d'erreurs. Libère l'équipe des opérations publicitaires.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Flux de Travail Axé sur la Transaction</h5><p class=\"mb-4 text-gray-600\">Il s'agit d'un flux de travail axé sur la transaction qui part de votre CRM.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Intégration API :</strong> Vous avez besoin d'un accès API à votre serveur publicitaire (par exemple, Google Ad Manager) et à votre système de facturation.</li><li><strong>Construisez le Flux :</strong> Utilisez le déclencheur Dataverse 'Lorsqu'une ligne est ajoutée, modifiée ou supprimée', et configurez-le pour s'exécuter lorsqu'une opportunité est marquée comme 'Gagnée-fermée'. Utilisez une action HTTP pour appeler l'API du serveur publicitaire afin de vérifier la disponibilité de l'inventaire. Utilisez une action 'Démarrer et attendre une approbation' pour l'approbation financière.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Automatisez le reporting de campagne. Créez un flux planifié qui s'exécute quotidiennement. Il peut interroger l'API du serveur publicitaire pour les données de performance de la veille de toutes les campagnes actives. Le flux peut ensuite utiliser un prompt AI Builder pour générer un résumé en langage naturel de la performance et l'envoyer par e-mail au vendeur et à l'annonceur.</p>" },
        { "id": 42, "title": "Calcul des Paiements de Redevances", "industry": "Médias et divertissement", "technology": "Power Automate", "miniDescription": "Automatisez le calcul complexe et la génération de relevés pour les paiements de redevances aux artistes, écrivains et partenaires.", "technicalLevel": 8, "problem": "Une maison d'édition musicale doit calculer et payer des redevances à des milliers d'auteurs-compositeurs. Cela implique de consolider les données d'utilisation de dizaines de plateformes de streaming, d'appliquer des répartitions de pourcentages complexes basées sur le contrat de chaque auteur-compositeur, puis de générer un relevé détaillé pour chaque personne.", "value": "Pour les entreprises de médias, le calcul et la distribution des paiements de redevances est un processus financier complexe, à haut volume et d'une importance critique. Cette solution automatise le calcul et la génération de relevés, garantissant précision et ponctualité.", "roi": "Le ROI se mesure en précision, efficacité et gestion des relations.\n\n<code>Formule :\nValeur = (Heures administratives économisées * Coût horaire) + (Coût des erreurs de paiement évitées)</code>\n\nExemple : Réduit considérablement le temps et les efforts requis pour le traitement mensuel des redevances. Élimine les erreurs coûteuses qui peuvent nuire aux relations avec les artistes et les partenaires. Fournit un enregistrement clair et vérifiable de tous les calculs et paiements.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Flux de Travail Intensif en Données</h5><p class=\"mb-4 text-gray-600\">Il s'agit d'un flux de travail intensif en données qui s'exécute selon un calendrier.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Consolidation des Données :</strong> Utilisez Power Automate Desktop (RPA) pour vous connecter aux portails des partenaires et télécharger les rapports d'utilisation. Stockez toutes les données brutes dans Azure Data Lake. Utilisez Power Query/Dataflows pour nettoyer, transformer et consolider les données.</li><li><strong>Construisez le Flux de Calcul :</strong> Créez un flux cloud planifié pour s'exécuter chaque mois. Utilisez des actions pour obtenir les données d'utilisation consolidées et les termes du contrat pour chaque artiste. Utilisez une boucle 'Apply to each' et des actions 'Composer' avec des expressions complexes pour effectuer les calculs. Utilisez l'action 'Remplir un modèle Microsoft Word' de Word Online pour générer le relevé.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Créez un portail artiste en libre-service. Utilisez Power Pages pour créer un portail sécurisé où les artistes peuvent se connecter et consulter leurs relevés de redevances actuels et historiques, qui sont générés par le flux Power Automate. Cela offre de la transparence et réduit le nombre de requêtes entrantes à votre équipe financière.</p>" }
    ]
}