{
    "catalogue": [
        { "id": 25, "title": "Le chien de garde numérique : automatisation de la saisie des rapports d'événements indésirables", "industry": "Produits pharmaceutiques", "technology": "Copilot Studio & Power Automate", "miniDescription": "Créez un système intelligent et automatisé pour la saisie des événements indésirables qui garantit la rapidité, la précision et une auditabilité réglementaire parfaite.", "iframeUrl": "#/placeholder" },
        { "id": 26, "title": "Accélérer la découverte : automatisation de la présélection des participants aux essais cliniques", "industry": "Produits pharmaceutiques", "technology": "Copilot Studio & Power Automate", "miniDescription": "Créez un assistant de présélection intelligent pour accélérer considérablement le recrutement de patients pour les essais cliniques, aidant à apporter plus rapidement de nouvelles thérapies aux patients.", "iframeUrl": "#/placeholder" },
        { "id": 27, "title": "L'archiviste IA : maîtriser votre bibliothèque de documents réglementaires", "industry": "Produits pharmaceutiques", "technology": "Copilot Studio", "miniDescription": "Créez un archiviste alimenté par l'IA qui peut comprendre et répondre aux questions sur le contenu de votre vaste bibliothèque de documents réglementaires.", "iframeUrl": "#/placeholder" },
        { "id": 28, "title": "La fin du journal de bord : automatisation de la saisie et du suivi des échantillons de laboratoire", "industry": "Produits pharmaceutiques", "technology": "Power Automate", "miniDescription": "Créez un système rationalisé et automatisé utilisant Power Apps qui rend la saisie des échantillons de laboratoire rapide, précise et sans erreur.", "iframeUrl": "#/placeholder" },
        { "id": 29, "title": "Le copilote du représentant : des réponses cliniques instantanées pour votre force de vente", "industry": "Produits pharmaceutiques", "technology": "Copilot Studio", "miniDescription": "Créez un 'copilote du représentant' alimenté par l'IA qui agit comme un expert à réponse instantanée sur les données cliniques, disponible 24/7 dans Microsoft Teams.", "iframeUrl": "#/placeholder" },
        { "id": 41, "title": "Traitement des paiements de subventions aux investigateurs cliniques", "industry": "Produits pharmaceutiques", "technology": "Power Automate", "miniDescription": "Automatisez la validation et l'approbation des factures des sites d'essais cliniques, garantissant des paiements rapides, précis et vérifiables.", "iframeUrl": "#/placeholder" },
        { "id": 42, "title": "Attribution et suivi de la formation GxP", "industry": "Produits pharmaceutiques", "technology": "Power Automate", "miniDescription": "Assurez-vous que la bonne formation GxP est attribuée à chaque employé en fonction de son rôle et que son achèvement est suivi automatiquement.", "iframeUrl": "#/placeholder" },
        { "id": 43, "title": "Demande et approbation d'accès au laboratoire", "industry": "Produits pharmaceutiques", "technology": "Power Automate", "miniDescription": "Rationalisez le processus de demande et d'approbation d'accès aux laboratoires sécurisés, en garantissant une autorisation appropriée et une piste d'audit claire.", "iframeUrl": "#/placeholder" },
        { "id": 44, "title": "Demande de contrôle de changement de système GxP", "industry": "Produits pharmaceutiques", "technology": "Power Automate", "miniDescription": "Numérisez et rationalisez le processus critique de contrôle des changements pour les systèmes informatiques validés GxP, garantissant la conformité et accélérant les changements.", "iframeUrl": "#/placeholder" },
        { "id": 45, "title": "Demande et approbation de matériel marketing (MLR)", "industry": "Produits pharmaceutiques", "technology": "Power Automate", "miniDescription": "Créez un flux de travail numérique rationalisé et vérifiable pour le processus rigoureux d'examen médical, juridique et réglementaire (MLR).", "iframeUrl": "#/placeholder" },
        { "id": 46, "title": "Provisionnement et archivage du carnet de laboratoire électronique (ELN)", "industry": "Produits pharmaceutiques", "technology": "Power Automate", "miniDescription": "Automatisez le cycle de vie complet des carnets de laboratoire électroniques, de la création et de l'autorisation à l'archivage sécurisé en lecture seule.", "iframeUrl": "#/placeholder" }
    ]
}
