{
    "catalogue": [
        { "id": 54, "title": "De 'Gagné-fermé' au Lancement en Quelques Minutes : Automatisation de la Configuration de Projet", "industry": "Services professionnels", "technology": "Power Automate", "miniDescription": "Passez en toute transparence d'une affaire 'gagnée-fermée' dans votre CRM à un projet entièrement provisionné et prêt à démarrer en quelques minutes.", "technicalLevel": 7, "problem": "Un directeur des ventes marque une opportunité comme 'Gagnée-fermée' dans Salesforce. Ce simple clic devrait être un moment de célébration, mais il déclenche une course manuelle effrénée. Le chef de projet doit créer manuellement un nouveau canal Teams, une structure de dossiers SharePoint, un plan de projet dans Planner, puis informer l'équipe financière de configurer le code de facturation.", "value": "Pour toute entreprise de services professionnels, le moment où une affaire est gagnée est critique. Cette solution crée un transfert transparent et automatisé des ventes à la livraison.", "roi": "Le ROI se mesure en heures non facturables économisées et en démarrages de projets plus rapides.\n\n<code>Formule :\nValeur = (Heures économisées par projet * Projets par an * Coût horaire du personnel) + (Valeur d'une facturation plus rapide)</code>\n\nExemple : Élimine des heures de temps de configuration manuel et non facturable pour chaque projet. Garantit que chaque projet est configuré avec une structure cohérente et de meilleures pratiques.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Une Orchestration Axée sur la Transaction</h5><p class=\"mb-4 text-gray-600\">Il s'agit d'une orchestration classique 'pilotée par les événements' qui part d'un déclencheur dans votre CRM.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Connecteur CRM :</strong> Cela nécessite le connecteur Power Automate pour votre CRM (par exemple, Salesforce, Dynamics 365).</li><li><strong>Construisez le Flux :</strong> Utilisez le déclencheur CRM approprié. Utilisez le connecteur Teams pour 'Créer une équipe' puis 'Créer un canal'. Utilisez l'action 'Envoyer une requête HTTP à SharePoint' du connecteur SharePoint pour appeler l'API de création de modèles de site. Utilisez le connecteur Planner pour 'Créer un plan' et le peupler.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Générez automatiquement la présentation de lancement. Créez un modèle de présentation PowerPoint standard. Dans le flux, utilisez l'action 'Remplir un modèle Microsoft Word' (elle fonctionne aussi pour PowerPoint !) pour insérer le nom du client, la portée du projet et les membres de l'équipe à partir des données du CRM.</p>" },
        { "id": 55, "title": "Le Gardien Numérique : Automatisation des Vérifications de Conflits d'Intérêts Clients", "industry": "Services professionnels", "technology": "Power Automate", "miniDescription": "Automatisez et normalisez le processus critique de vérification des conflits d'intérêts clients, en offrant rapidité, certitude et en atténuant les risques catastrophiques.", "technicalLevel": 8, "problem": "Un associé d'un cabinet d'avocats est sur le point de prendre un nouveau client. Avant cela, un jeune collaborateur est chargé de la vérification des conflits. Cela implique de rechercher manuellement dans plusieurs bases de données internes et sources externes toute relation conflictuelle. Le processus est lent et comporte l'immense risque de manquer un conflit.", "value": "Pour les cabinets d'avocats, les sociétés de conseil et les conseillers financiers, la vérification des conflits d'intérêts clients est un processus non négociable à enjeux élevés. Cette solution automatise et normalise cette passerelle critique.", "roi": "Le ROI est presque entièrement lié à l'atténuation des risques.\n\n<code>Formule :\nValeur = (Valeur d'un procès majeur/dommage réputationnel évité)</code>\n\nExemple : La valeur principale est l'atténuation d'un risque commercial catastrophique. Un conflit manqué peut entraîner des procès de plusieurs millions d'euros et des dommages de marque irréversibles. Cette automatisation fournit un processus rapide, approfondi et vérifiable.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Flux de Travail Intensif en Données</h5><p class=\"mb-4 text-gray-600\">Cette solution utilise une Power App comme interface pour la demande et un flux Power Automate pour interroger plusieurs sources de données.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Accès aux Données :</strong> Vous avez besoin d'un accès API sécurisé en lecture seule à vos systèmes de gestion de cas et de facturation.</li><li><strong>Construisez la Power App :</strong> Créez une application canevas simple pour soumettre la demande de vérification de conflit.</li><li><strong>Construisez le Flux :</strong> Déclenchez depuis la Power App. Utilisez une action 'Branche parallèle' pour interroger toutes vos sources de données internes et externes simultanément. Utilisez une 'Condition' pour vérifier si des résultats ont été trouvés. Utilisez un prompt AI Builder pour résumer les résultats et les risques potentiels. Utilisez 'Démarrer et attendre une approbation' pour acheminer le résumé au responsable de la conformité.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Créez automatiquement un 'mur éthique'. Si le responsable de la conformité approuve l'engagement mais note un conflit potentiel, le flux peut automatiquement créer un canal Microsoft Teams privé et n'ajouter que les membres de l'équipe spécifiques et approuvés.</p>", "interactiveComponent": "ConflictCheckDemo" },
        { "id": 56, "title": "L'Auditeur Instantané : Un Bot IA pour les Politiques de Temps et de Dépenses", "industry": "Services professionnels", "technology": "Copilot Studio", "miniDescription": "Construisez un Copilote IA qui fournit des réponses immédiates, précises et cohérentes à toutes les questions des employés sur les politiques de temps et de dépenses.", "technicalLevel": 3, "problem": "Un consultant est sur le point de soumettre sa feuille de temps et n'est pas sûr du code de projet interne à utiliser. Il demande à un collègue, qui lui donne un code obsolète. La feuille de temps est soumise de manière incorrecte, ce qui entraîne une charge de travail supplémentaire pour l'équipe financière.", "value": "Dans une entreprise de services professionnels, l'enregistrement précis du temps et des dépenses est le fondement du modèle commercial. Cette solution fournit un Copilote alimenté par l'IA qui agit comme un expert 24/7 sur les politiques de votre entreprise.", "roi": "Le ROI se mesure par l'amélioration de la qualité des données et de la conformité.\n\n<code>Formule :\nValeur = (Valeur d'une facturation précise / Réduction du travail de correction) + (Heures administratives économisées)</code>\n\nExemple : Améliore la précision des soumissions de feuilles de temps et de notes de frais, ce qui conduit à une facturation plus rapide et plus précise. Réduit le temps que les équipes financières et opérationnelles passent à corriger les erreurs.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Copilote Basé sur la Connaissance</h5><p class=\"mb-4 text-gray-600\">Il s'agit d'un Copilote classique basé sur la connaissance et alimenté par les Réponses Génératives.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Créez la Base de Connaissances :</strong> Créez un site SharePoint comme source unique de vérité pour toutes les politiques de temps et de dépenses.</li><li><strong>Construisez le Copilote :</strong> Dans Copilot Studio, créez un nouveau Copilote. Dans la section IA Générative, pointez la source de contenu vers l'URL de votre site SharePoint.</li><li><strong>Déployez :</strong> Déployez le Copilote dans Teams pour le rendre facilement accessible à tous les employés.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Rendez-le transactionnel. Créez un plugin Power Automate appelé 'Trouver le code de projet'. Le plugin peut interroger votre système de gestion de projet. Désormais, un consultant peut demander au Copilote : 'Quel est le code de projet pour l'engagement ACME Corp ?' et obtenir une réponse instantanée.</p>" }
    ]
}