{
    "catalogue": [
        { "id": 54, "title": "From 'Closed-Won' to Kickoff in Minutes: Automating Project Setup", "industry": "Professional Services", "technology": "Power Automate", "miniDescription": "Seamlessly transition a deal from 'Closed-Won' in your CRM to a fully provisioned, ready-to-start project in minutes.", "technicalLevel": 7, "problem": "A sales director marks an opportunity as 'Closed-Won' in Salesforce. This simple click should be a moment of celebration, but instead, it kicks off a frantic, manual scramble. The project manager has to manually create a new Teams channel, a SharePoint folder structure, a project plan in Planner, and then notify the finance team to set up the billing code. The process takes hours and risks inconsistent setups.", "value": "For any professional services firm, the moment a deal is won is critical. This solution creates a seamless, automated handoff from sales to delivery.", "roi": "The ROI is measured in non-billable hours saved and faster project starts.\n\n<code>Formula:\nValue = (Hours Saved per Project * Projects per Year * Staff Hourly Cost) + (Value of Faster Time-to-Billing)</code>\n\nExample: Eliminates hours of manual, non-billable setup time for every single project. Ensures every project is set up with a consistent, best-practice structure. Allows the project team to engage with the client faster, accelerating the time to the first billable milestone.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">The Solution Blueprint: A Deal-Driven Orchestration</h5><p class=\"mb-4 text-gray-600\">This is a classic 'event-driven' orchestration that starts from a trigger in your CRM.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Step-by-Step Implementation Guide</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>CRM Connector:</strong> This requires the Power Automate connector for your CRM (e.g., Salesforce, Dynamics 365).</li><li><strong>Build the Flow:</strong> Use the appropriate CRM trigger. Use the Teams connector to 'Create a team' and then 'Create a channel'. Use the SharePoint connector's 'Send an HTTP request to SharePoint' action to call the site templating API. Use the Planner connector to 'Create a plan' and then loop through a predefined list of tasks to populate it.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Beyond the Basics (Pro-Tip)</h5><p class=\"text-gray-600\">Generate the kickoff deck automatically. Create a standard PowerPoint presentation template for your project kickoffs. In the flow, use the 'Populate a Microsoft Word Template' action (it works for PowerPoint too!) to insert the client's name, project scope, and team members from the CRM data into the kickoff deck. The flow then saves this pre-populated deck directly into the new project's SharePoint folder.</p>" },
        { "id": 55, "title": "The Digital Gatekeeper: Automating Client Conflict Checks", "industry": "Professional Services", "technology": "Power Automate", "miniDescription": "Automate and standardize the critical client conflict check process, providing speed, certainty, and mitigating catastrophic risk.", "technicalLevel": 8, "problem": "A partner at a law firm is about to engage a new client. Before they can, a junior associate is tasked with the conflict check. This involves manually searching multiple internal databases (case management, billing) and external sources for any adverse relationships. The process is slow, relies on institutional memory, and carries the immense risk of missing a conflict, which could lead to disqualification from a case and severe reputational damage.", "value": "For law firms, consulting firms, and financial advisors, the client conflict check is a non-negotiable, high-stakes process. This solution automates and standardizes this critical gateway.", "roi": "The ROI is almost entirely in risk mitigation.\n\n<code>Formula:\nValue = (Value of a Major Lawsuit/Reputational Damage Event Averted)</code>\n\nExample: The primary value is mitigating a catastrophic business risk. A missed conflict can lead to multi-million Euro lawsuits and irreversible brand damage. This automation provides a fast, thorough, and auditable process that acts as a critical insurance policy. It also frees up junior staff from tedious manual research.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">The Solution Blueprint: A Data-Intensive Workflow</h5><p class=\"mb-4 text-gray-600\">This solution uses a Power App as the front-end for the request and a Power Automate flow to query multiple data sources.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Step-by-Step Implementation Guide</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Data Access:</strong> You need secure, read-only API access to your case management and billing systems.</li><li><strong>Build the Power App:</strong> Create a simple canvas app for submitting the conflict check request.</li><li><strong>Build the Flow:</strong> Trigger from the Power App. Use a 'Parallel branch' action to query all your internal and external data sources simultaneously. Use a 'Condition' to check if any results were found. Use an AI Builder prompt to summarize the findings and potential risks. Use 'Start and wait for an approval' to route the summary to the compliance officer for a final decision.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Beyond the Basics (Pro-Tip)</h5><p class=\"text-gray-600\">Create an 'ethical wall' automatically. If the compliance officer approves the engagement but notes a potential conflict that needs to be managed, the flow can automatically create a private Microsoft Teams channel and add only the specific, approved team members. It can also apply a data loss prevention (DLP) policy to that channel, preventing any information from being shared outside of that approved group.</p>", "interactiveComponent": "ConflictCheckDemo" },
        { "id": 56, "title": "The Instant Auditor: An AI-Powered Bot for Time and Expense Policies", "industry": "Professional Services", "technology": "Copilot Studio", "miniDescription": "Build an AI-powered Copilot that provides immediate, accurate, and consistent answers to all employee questions about time and expense policies.", "technicalLevel": 3, "problem": "A consultant is about to submit their weekly timesheet and isn't sure which internal project code to use for their non-billable training time. They ask a colleague, who gives them the code they used last year, which is now out of date. The timesheet is submitted incorrectly, causing rework for the finance team.", "value": "In a professional services firm, accurately recording time and expenses is the foundation of the entire business model. This solution provides an AI-powered Copilot that acts as a 24/7 expert on your firm's policies.", "roi": "The ROI is measured in improved data quality and compliance.\n\n<code>Formula:\nValue = (Value of Accurate Billing/Reduced Rework) + (Admin Hours Saved)</code>\n\nExample: Improves the accuracy of timesheet and expense submissions, leading to faster, more accurate billing and fewer client disputes. Reduces the time finance and operations teams spend correcting errors. Provides a better, self-service experience for all employees.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">The Solution Blueprint: A Knowledge-Based Copilot</h5><p class=\"mb-4 text-gray-600\">This is a classic knowledge-based Copilot powered by Generative Answers.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Step-by-Step Implementation Guide</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Create the Knowledge Base:</strong> Create a SharePoint site to be the single source of truth for all time and expense policies.</li><li><strong>Build the Copilot:</strong> In Copilot Studio, create a new Copilot. In the Generative AI section, point the content source to your SharePoint site URL.</li><li><strong>Deploy:</strong> Deploy the Copilot in Teams to make it easily accessible to all employees.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Beyond the Basics (Pro-Tip)</h5><p class=\"text-gray-600\">Make it transactional. Create a Power Automate plugin called \"Find Project Code.\" The plugin can query your project management system. Now, a consultant can ask the Copilot, \"What is the project code for the ACME Corp engagement?\" The Copilot will use the plugin to get the answer and provide it instantly, ensuring the right code is used every time.</p>" }
    ]
}