
{
    "catalogue": [
        { "id": 61, "title": "The 24/7 City Hall: Automating Citizen Service Requests", "industry": "Public Sector", "technology": "Copilot Studio & Power Automate", "miniDescription": "Build an AI assistant that allows citizens to report non-emergency issues like potholes or broken streetlights instantly, any time of day.", "technicalLevel": 5, "problem": "A resident notices a broken streetlight on her street. To report it, she has to navigate the complex city website during business hours or wait on hold. This friction discourages reporting and delays repairs.", "value": "This solution provides a 24/7 digital 'front door' for the city. It allows citizens to report non-emergency issues easily, improving service delivery and providing valuable data for maintenance planning.", "roi": "The ROI is measured in efficiency and citizen satisfaction.\n\n<code>Formula:\nValue = (Admin Hours Saved) + (Value of Increased Citizen Satisfaction/Engagement)</code>\n\nExample: Reduces call center volume for common requests. Provides a better, more accessible experience for residents. Creates a real-time data source of infrastructure issues across the city.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">The Solution Blueprint: A Tier 2 Hybrid Approach</h5><p class=\"mb-4 text-gray-600\">This solution uses a conversational intake (Topic) and a backend workflow (Plugin).</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Step-by-Step Implementation Guide</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Build the Topic:</strong> In Copilot Studio, create a Topic to guide the citizen through the report, capturing key details like issue type and location.</li><li><strong>Build the Plugin:</strong> The Power Automate flow takes the report details and creates a work order in the city's public works management system (e.g., Cityworks, SeeClickFix).</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Beyond the Basics (Pro-Tip)</h5><p class=\"text-gray-600\">Close the loop. When the work order is marked as 'Complete' in the backend system, trigger another Power Automate flow that sends an automated email or SMS to the citizen who originally reported the issue, letting them know it has been resolved. This simple step dramatically increases citizen satisfaction and trust.</p>" },
        { "id": 62, "title": "Cut the Red Tape: Automating Permit Applications and Status Checks", "industry": "Public Sector", "technology": "Copilot Studio & Power Automate", "miniDescription": "Build a digital permitting assistant that streamlines the entire lifecycle, from a guided application to on-demand status checks.", "technicalLevel": 7, "problem": "A local business owner wants to apply for a permit to expand their patio. The process involves downloading a 20-page PDF, filling it out by hand, and mailing it to the city planning department. They have no visibility into the status of their application until they receive a letter weeks later.", "value": "This solution digitizes and automates the entire permitting process. It provides a simple, guided experience for applicants and an efficient, auditable workflow for the government agency.", "roi": "The ROI is measured in accelerated economic activity and administrative efficiency.\n\n<code>Formula:\nValue = (Value of Faster Business Openings/Projects) + (Admin Hours Saved)</code>\n\nExample: Accelerates the permitting process, which helps local businesses and economic development. Reduces the administrative burden on agency staff. Provides complete transparency to applicants.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">The Solution Blueprint: A Portal and Workflow Solution</h5><p class=\"mb-4 text-gray-600\">This solution uses a Power Pages portal for the application and a Power Automate flow for the backend processing.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Step-by-Step Implementation Guide</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Build the Portal:</strong> Create a Power Pages site with a secure, multi-step form for the permit application.</li><li><strong>Build the Flow:</strong> Trigger from the form submission. The flow routes the application for internal review, calls an external service for payment processing, and creates a record in a central tracking system (like a SharePoint list or Dataverse table).</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Beyond the Basics (Pro-Tip)</h5><p class=\"text-gray-600\">Create a companion Copilot plugin called \"Check Permit Status.\" An applicant can then interact with a bot on the city's website and ask, \"What is the status of my permit application #12345?\" The plugin queries the tracking system and provides a real-time update.</p>" }
    ]
}
