{
    "catalogue": [
        { "id": 30, "title": "La mairie 24/7 : automatisation des demandes de services des citoyens", "industry": "Secteur public", "technology": "Copilot Studio & Power Automate", "miniDescription": "Créez un assistant IA qui permet aux citoyens de signaler instantanément des problèmes non urgents comme des nids-de-poule ou des lampadaires cassés, à toute heure du jour.", "iframeUrl": "#/placeholder" },
        { "id": 31, "title": "Réduisez la paperasse : automatisation des demandes de permis et des vérifications de statut", "industry": "Secteur public", "technology": "Copilot Studio & Power Automate", "miniDescription": "Créez un assistant numérique pour les permis qui rationalise l'ensemble du cycle de vie, d'une application guidée aux vérifications de statut à la demande.", "iframeUrl": "#/placeholder" },
        { "id": 32, "title": "De l'arriéré à la percée : automatisation de la gestion des demandes FOIA", "industry": "Secteur public", "technology": "Power Automate", "miniDescription": "Rationalisez l'ensemble du cycle de vie de la loi sur la liberté d'information (FOIA), d'un portail d'admission structuré au suivi automatisé des délais et à l'attribution des tâches.", "iframeUrl": "#/placeholder" },
        { "id": 33, "title": "Le conseiller numérique : un bot de politique alimenté par l'IA pour les fonctionnaires", "industry": "Secteur public", "technology": "Copilot Studio", "miniDescription": "Créez un Copilote alimenté par l'IA qui fournit aux fonctionnaires des réponses instantanées, précises et cohérentes à toute question de politique interne.", "iframeUrl": "#/placeholder" },
        { "id": 34, "title": "Récupérez votre temps : résumé alimenté par l'IA pour les procès-verbaux de réunions publiques", "industry": "Secteur public", "technology": "Power Automate", "miniDescription": "Utilisez l'IA pour écouter un enregistrement de réunion publique et générer un projet de procès-verbal de haute qualité en une fraction du temps.", "iframeUrl": "#/placeholder" },
        { "id": 47, "title": "Prise en charge des demandes de service des citoyens", "industry": "Secteur public", "technology": "Copilot Studio & Power Automate", "miniDescription": "Créez un assistant numérique de type '311' qui permet aux citoyens de signaler des problèmes 24/7, qui sont ensuite acheminés intelligemment vers le service municipal approprié pour action.", "iframeUrl": "#/placeholder" },
        { "id": 48, "title": "Traitement des demandes de permis", "industry": "Secteur public", "technology": "Power Automate", "miniDescription": "Numérisez l'ensemble du flux de travail de demande et d'approbation de permis, offrant une meilleure expérience aux citoyens et une plus grande efficacité pour l'agence gouvernementale.", "iframeUrl": "#/placeholder" },
        { "id": 49, "title": "Gestion des demandes de documents publics (FOIA)", "industry": "Secteur public", "technology": "Power Automate", "miniDescription": "Gérez le cycle de vie des demandes FOIA de la réception à la livraison, en garantissant la conformité et en réduisant la charge administrative.", "iframeUrl": "#/placeholder" },
        { "id": 50, "title": "Planification et distribution des procès-verbaux de réunions publiques", "industry": "Secteur public", "technology": "Power Automate", "miniDescription": "Automatisez l'ensemble du flux de communication et de documentation pour les réunions publiques.", "iframeUrl": "#/placeholder" },
        { "id": 51, "title": "Questions sur les avantages sociaux et les politiques des employés", "industry": "Secteur public", "technology": "Copilot Studio", "miniDescription": "Fournissez un outil en libre-service permettant aux employés d'obtenir des réponses instantanées et précises aux questions sur les avantages sociaux, les politiques et les procédures.", "iframeUrl": "#/placeholder" },
        { "id": 52, "title": "Intégration des nouveaux employés", "industry": "Secteur public", "technology": "Power Automate", "miniDescription": "Automatisez et orchestrez l'ensemble de la liste de contrôle d'intégration pour garantir une expérience parfaite dès le premier jour pour chaque nouvelle recrue.", "iframeUrl": "#/placeholder" }
    ]
}
