
{
    "catalogue": [
        { "id": 61, "title": "La mairie 24/7 : automatisation des demandes de services des citoyens", "industry": "Secteur public", "technology": "Copilot Studio & Power Automate", "miniDescription": "Créez un assistant IA qui permet aux citoyens de signaler instantanément des problèmes non urgents comme des nids-de-poule ou des lampadaires cassés, à toute heure du jour.", "technicalLevel": 5, "problem": "Une résidente remarque un lampadaire cassé dans sa rue. Pour le signaler, elle doit naviguer sur le site web complexe de la ville pendant les heures de bureau ou attendre en ligne. Cette friction décourage le signalement et retarde les réparations.", "value": "Cette solution fournit une 'porte d'entrée' numérique 24/7 pour la ville. Elle permet aux citoyens de signaler facilement les problèmes non urgents, améliorant la prestation de services et fournissant des données précieuses pour la planification de la maintenance.", "roi": "Le ROI se mesure en efficacité et en satisfaction des citoyens.\n\n<code>Formule :\nValeur = (Heures administratives économisées) + (Valeur de l'augmentation de la satisfaction/engagement des citoyens)</code>\n\nExemple : Réduit le volume des centres d'appels pour les demandes courantes. Offre une expérience meilleure et plus accessible aux résidents. Crée une source de données en temps réel sur les problèmes d'infrastructure dans toute la ville.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Une Approche Hybride de Niveau 2</h5><p class=\"mb-4 text-gray-600\">Cette solution utilise une prise en charge conversationnelle (Sujet) et un flux de travail backend (Plugin).</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Construisez le Sujet :</strong> Dans Copilot Studio, créez un Sujet pour guider le citoyen à travers le rapport, en capturant les détails clés comme le type de problème et l'emplacement.</li><li><strong>Construisez le Plugin :</strong> Le flux Power Automate prend les détails du rapport et crée un ordre de travail dans le système de gestion des travaux publics de la ville.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Bouclez la boucle. Lorsque l'ordre de travail est marqué comme 'Terminé' dans le système backend, déclenchez un autre flux Power Automate qui envoie un e-mail ou un SMS automatisé au citoyen qui a initialement signalé le problème, l'informant qu'il a été résolu. Cette simple étape augmente considérablement la satisfaction et la confiance des citoyens.</p>" },
        { "id": 62, "title": "Réduisez la paperasse : automatisation des demandes de permis et des vérifications de statut", "industry": "Secteur public", "technology": "Copilot Studio & Power Automate", "miniDescription": "Créez un assistant numérique pour les permis qui rationalise l'ensemble du cycle de vie, d'une application guidée aux vérifications de statut à la demande.", "technicalLevel": 7, "problem": "Un propriétaire d'entreprise local souhaite demander un permis pour agrandir sa terrasse. Le processus implique de télécharger un PDF de 20 pages, de le remplir à la main et de l'envoyer par la poste au service d'urbanisme de la ville. Il n'a aucune visibilité sur le statut de sa demande jusqu'à ce qu'il reçoive une lettre des semaines plus tard.", "value": "Cette solution numérise et automatise l'ensemble du processus de demande de permis. Elle offre une expérience simple et guidée aux demandeurs et un flux de travail efficace et vérifiable pour l'agence gouvernementale.", "roi": "Le ROI se mesure en accélération de l'activité économique et en efficacité administrative.\n\n<code>Formule :\nValeur = (Valeur des ouvertures d'entreprises/projets plus rapides) + (Heures administratives économisées)</code>\n\nExemple : Accélère le processus de délivrance des permis, ce qui aide les entreprises locales et le développement économique. Réduit la charge administrative du personnel de l'agence. Offre une transparence totale aux demandeurs.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Une Solution de Portail et de Flux de Travail</h5><p class=\"mb-4 text-gray-600\">Cette solution utilise un portail Power Pages pour la demande et un flux Power Automate pour le traitement backend.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Construisez le Portail :</strong> Créez un site Power Pages avec un formulaire sécurisé en plusieurs étapes pour la demande de permis.</li><li><strong>Construisez le Flux :</strong> Déclenchez à partir de la soumission du formulaire. Le flux achemine la demande pour un examen interne, appelle un service externe pour le traitement des paiements et crée un enregistrement dans un système de suivi central.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Créez un plugin Copilot compagnon appelé 'Vérifier le statut du permis'. Un demandeur peut alors interagir avec un bot sur le site web de la ville et demander : 'Quel est le statut de ma demande de permis n°12345 ?' Le plugin interroge le système de suivi et fournit une mise à jour en temps réel.</p>" }
    ]
}
