
{
    "catalogue": [
        { "id": 74, "title": "Le Concierge Numérique : Service Client IA pour les Télécoms", "industry": "Télécom", "technology": "Copilot Studio & Power Automate", "miniDescription": "Déployez un concierge numérique IA qui fournit des réponses instantanées aux questions courantes et gère des tâches transactionnelles comme le paiement de factures.", "technicalLevel": 6, "problem": "Une cliente, Sarah, veut savoir combien de données il lui reste sur son forfait mobile. Elle appelle le service client, navigue dans un menu SVI complexe et attend 10 minutes, pour poser une question qui aurait pu être résolue par une simple consultation de compte. L'expérience est frustrante pour Sarah et coûteuse pour le fournisseur.", "value": "Les centres de contact des télécoms sont inondés de requêtes à fort volume et faible complexité. Cela augmente les coûts opérationnels et empêche les agents de se concentrer sur des interactions à plus forte valeur. Ce guide montre comment construire un concierge numérique qui détourne ces requêtes courantes et offre une expérience client supérieure.", "roi": "A = Nombre d'appels détournés du centre de contact par mois.\nB = Coût moyen pour traiter un appel d'agent en direct.\n\n<code>Formule :\nÉconomies Mensuelles = A * B</code>\n\nExemple : Si le Copilot détourne 100 000 appels par mois (A) à un coût moyen de 7 $ par appel (B), les économies opérationnelles directes sont de 700 000 $ par mois. Cela améliore également la satisfaction client.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Une Approche Hybride de Niveau 1 & 2</h5><p class=\"mb-4 text-gray-600\">Cette solution combine la puissance des Réponses Génératives pour les requêtes informationnelles avec des Sujets structurés et des plugins Power Automate pour les tâches transactionnelles.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Construisez la Base de Connaissances :</strong> Créez un site SharePoint avec tous vos articles d'aide publics. Dans Copilot Studio, pointez la fonction d'IA Générative vers cette URL.</li><li><strong>Construisez des Plugins Transactionnels :</strong> Pour des actions comme 'Payer ma facture', créez des flux Power Automate qui se connectent à vos systèmes de facturation et CRM via une API.</li><li><strong>Implémentez l'Authentification :</strong> Pour effectuer des actions spécifiques au compte, configurez l'authentification de l'utilisateur dans votre Copilot.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Créez un moteur de communication proactif. Utilisez un flux Power Automate planifié pour identifier les clients qui approchent de leur limite de données. Le flux peut alors envoyer une notification proactive : 'Bonjour Sarah, vous avez utilisé 90% de vos données. Souhaitez-vous ajouter 5 Go pour 10 $ ?' avec une confirmation en un clic.</p>" },
        { "id": 75, "title": "Dispatch des Techniciens sur le Terrain", "industry": "Télécom", "technology": "Power Automate", "miniDescription": "Automatisez le flux de travail de dispatch pour envoyer le bon technicien au bon endroit avec les bonnes informations, plus rapidement.", "technicalLevel": 7, "problem": "Un agent du service client détermine que le problème d'un client nécessite une visite technique. L'agent doit créer manuellement un ordre de travail dans un système distinct, puis consulter une feuille de calcul pour voir quels techniciens sont disponibles, et enfin appeler le technicien. Le processus est lent et inefficace.", "value": "Lorsqu'un problème client ne peut être résolu à distance, un technicien doit être envoyé. Ce processus implique la création d'un ordre de travail, la recherche du bon technicien et la planification de la visite. Cette automatisation rationalise l'ensemble du flux de travail.", "roi": "Le ROI se mesure en efficacité opérationnelle et en satisfaction client.\nA = Réduction du temps de dispatch d'un technicien (en minutes).\nB = Nombre de dispatches par mois.\nC = Augmentation du taux de résolution au premier contact.\n\n<code>Formule :\nValeur = (Temps Économisé + Efficacité Améliorée)</code>\n\nExemple : Réduire le temps de dispatch de 15 minutes (A) sur 2 000 dispatches (B) économise 500 heures de temps administratif par mois. Une augmentation de 5% du taux de résolution au premier contact (C) réduit les visites répétées coûteuses.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Flux de Travail Backend</h5><p class=\"mb-4 text-gray-600\">Ce flux de travail est déclenché à la fin du processus de dépannage.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Intégration Système :</strong>  Cette solution nécessite un système de gestion de service sur le terrain moderne (comme Dynamics 365) qui suit l'emplacement, les compétences et les horaires des techniciens.</li><li><strong>Construisez le Flux :</strong> Déclenchez le flux à partir d'un bouton Power App. Utilisez l'action 'Créer une nouvelle ligne' pour créer l'ordre de travail. Utilisez l'action 'Lister les lignes' avec des requêtes de filtre avancées pour trouver les techniciens disponibles. Utilisez 'Mettre à jour une ligne' pour assigner l'ordre de travail.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Automatisez la communication client. Une fois l'ordre de travail assigné, le flux peut automatiquement envoyer un SMS au client : 'Votre technicien, David, est confirmé pour votre rendez-vous demain entre 14h et 16h.' Cela tient le client informé.</p>" },
        { "id": 76, "title": "Communication Proactive sur les Pannes", "industry": "Télécom", "technology": "Power Automate", "miniDescription": "Informez automatiquement les clients concernés dès qu'une panne de service est détectée, transformant un événement négatif en une expérience client positive.", "technicalLevel": 8, "problem": "Une panne de réseau affecte un quartier. La première indication du problème pour l'entreprise de télécommunications est lorsque son centre d'appels est soudainement inondé de centaines d'appels de clients en colère. Les agents n'ont aucune information à leur donner.", "value": "Lorsqu'une panne de service se produit, la meilleure façon de gérer la frustration des clients est une communication proactive. Au lieu d'attendre que les clients appellent, cette solution informe automatiquement les clients concernés dès qu'une panne est détectée.", "roi": "Le ROI se mesure en déviation d'appels et en satisfaction client améliorée.\nA = Nombre d'appels entrants évités lors d'une panne.\nB = Coût par appel.\n\n<code>Formule :\nÉconomies par Panne = A * B</code>\n\nExemple : Éviter 5 000 appels (A) à un coût de 7 $ par appel (B) économise 35 000 $ pour un seul événement de panne majeur. L'amélioration de la perception de la marque est inestimable.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Flux de Travail Piloté par les Événements</h5><p class=\"mb-4 text-gray-600\">Il s'agit d'un flux de travail proactif et piloté par les événements, alimenté par Power Automate.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Déclencheur API :</strong> La clé est la capacité de votre système de surveillance de réseau à déclencher le flux, généralement via un webhook.</li><li><strong>Intégration CRM :</strong> Vous avez besoin d'un accès fiable à votre CRM pour obtenir une liste de clients en fonction de leur adresse de service.</li><li><strong>Construisez le Flux :</strong> Utilisez le déclencheur de requête HTTP. Utilisez une action 'Lister les lignes' sur votre base de données clients, en filtrant par les données de localisation. Utilisez une boucle 'Apply to each' pour parcourir les clients concernés et leur envoyer un SMS ou un e-mail.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Créez un service d'abonnement en libre-service. Permettez aux clients de s'inscrire pour recevoir des notifications de panne pour plusieurs adresses (par exemple, leur domicile et celui de leurs parents âgés). Ces données sont stockées dans une liste que le flux de panne proactif peut interroger.</p>" }
    ]
}
