
{
    "catalogue": [
        { "id": 77, "title": "Rapport de Défaut de Compteur Intelligent", "industry": "Services publics", "technology": "Power Automate", "miniDescription": "Automatisez le processus de réception des signaux de défaut des compteurs intelligents, de diagnostic du problème avec l'IA et de création d'un ordre de travail.", "technicalLevel": 8, "problem": "Un compteur d'électricité intelligent détecte un défaut interne. Il envoie un code de diagnostic à un serveur central, où il reste dans un fichier journal jusqu'à ce qu'un analyste l'examine le lendemain matin. Le client n'est pas conscient du problème jusqu'à ce que son courant soit coupé.", "value": "Avec le déploiement des compteurs intelligents, les entreprises de services publics peuvent désormais recevoir des signaux de défaut automatisés directement du terrain. Cette solution automatise le processus de réception de ces signaux, de diagnostic du problème et de création d'un ordre de travail, transformant les données brutes en une réponse exploitable.", "roi": "Le ROI se mesure en maintenance proactive et en fiabilité améliorée.\n\n<code>Formule :\nValeur = (Coût d'une Panne Évitée * Nombre de Pannes Évitées) + (Heures de Surveillance Manuelle Économisées * Coût Horaire)</code>\n\nExemple : Permet une maintenance proactive, permettant à l'utilitaire de résoudre les problèmes avant qu'ils ne provoquent une interruption de service pour le client. Améliore la fiabilité du réseau et la satisfaction des clients.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Flux de Travail Piloté par les Événements</h5><p class=\"mb-4 text-gray-600\">Il s'agit d'un flux de travail piloté par les événements, déclenché par un appareil IoT.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Intégration IoT :</strong> Vous avez besoin d'un Azure IoT Hub pour recevoir les messages des compteurs intelligents, et d'un connecteur Power Automate pour IoT Hub.</li><li><strong>Construisez le Flux :</strong> Utilisez le déclencheur 'Lorsqu'un nouveau message est reçu dans un IoT Hub'. Utilisez une action 'Analyser le JSON' pour extraire les données. Utilisez un contrôle 'Switch' sur la propriété 'Code de Défaut'. Dans chaque cas, ajoutez l'action appropriée : Créer une tâche, Mettre à jour une ligne ou Créer un ordre de travail.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Prédisez les pannes avant qu'elles ne se produisent. Au lieu de simplement réagir aux codes de défaut, collectez toutes les données de diagnostic des compteurs au fil du temps. Utilisez ces données pour entraîner un modèle de Prédiction AI Builder afin d'identifier les schémas qui précèdent une défaillance. Le flux peut alors s'exécuter quotidiennement sur tous les compteurs et, si le modèle prédit une forte probabilité de panne, il peut planifier un remplacement de manière proactive.</p>" },
        { "id": 78, "title": "Demande de Nouveau Raccordement de Service", "industry": "Services publics", "technology": "Power Automate", "miniDescription": "Numérisez et automatisez l'ensemble du flux de travail de nouveau raccordement de service, de la demande et de la vérification de crédit à la création de compte et au dispatch.", "technicalLevel": 7, "problem": "Un nouveau propriétaire appelle la compagnie de services publics pour installer son service d'électricité. L'agent prend ses coordonnées par téléphone, puis remplit un formulaire interne. Ce formulaire va au service de crédit pour une vérification, puis à l'équipe de dispatch pour planifier un technicien. Le processus prend plusieurs jours.", "value": "Lorsqu'un client emménage dans une nouvelle propriété, il a besoin que son service soit raccordé. Ce processus implique souvent de la paperasse manuelle. Cette solution numérise et automatise l'ensemble du flux de travail de nouveau raccordement.", "roi": "Le ROI se mesure en expérience client et en efficacité.\n\n<code>Formule :\nValeur = (Heures Administratives Économisées * Coût Horaire) + (Valeur de l'Expérience Client Améliorée)</code>\n\nExemple : Offre une expérience numérique et en libre-service moderne aux nouveaux clients. Réduit la charge de travail administrative des agents du service client. Accélère le processus de nouveau raccordement de plusieurs jours à quelques minutes.", "implementationGuide": "<h5 class=\"font-bold text-lg mt-4 mb-2\">Le Plan de la Solution : Un Flux de Travail Piloté par un Portail</h5><p class=\"mb-4 text-gray-600\">Cette solution combine un portail orienté client avec un flux de travail backend.</p><h5 class=\"font-bold text-lg mt-4 mb-2\">Guide de Mise en Œuvre</h5><ol class=\"list-decimal list-inside space-y-3 text-gray-600\"><li><strong>Construisez le Portail :</strong> Créez un site Power Pages convivial pour les nouvelles demandes de service.</li><li><strong>Intégration API :</strong> Vous aurez besoin d'un accès API à un service de vérification de crédit, ainsi qu'à vos systèmes CRM et de service sur le terrain.</li><li><strong>Construisez le Flux :</strong> Déclenchez à partir de la soumission du formulaire Power Pages. Utilisez une action HTTP pour appeler l'API du bureau de crédit. Utilisez une 'Condition' pour vérifier le score de crédit. Utilisez les actions 'Créer une nouvelle ligne' pour créer le compte client et l'ordre de travail.</li></ol><h5 class=\"font-bold text-lg mt-6 mb-2\">Au-delà des Bases (Conseil de Pro)</h5><p class=\"text-gray-600\">Offrez un package 'emménagement'. Dans le cadre du flux de travail, associez-vous à des entreprises locales de télécommunications ou d'assurance. Le flux peut utiliser un prompt AI Builder pour générer une offre personnalisée. L'e-mail de confirmation pourrait inclure cette offre exclusive : 'En tant que nouveau résident, bénéficiez de 20% de réduction sur votre première année d'internet à domicile de notre partenaire, TelcoSwiss.'</p>" }
    ]
}
